#include "stdafx.h"
#include "S3Signage.h"
#include "S3VMRWizard.h"
#include "S3RenderEngine.h"
#include "S3VMRCaptureSubgraph.h"
#include "CaptureRenderer.h"
#include "Utilities\wd3iface_i.h "
#include "Utilities\StringUtility.h"

#import "Utilities\DGC133ST.tlb" no_namespace named_guids

#define S3C_ENABLEYUY2 1



#define MAX_SUPPORTED_CAPTURE_CARDS     20
#define MAX_SUB_CHILD_COUNT             4

#define MAX_CHILD_DEVICES               (MAX_SUPPORTED_CAPTURE_CARDS*MAX_SUB_CHILD_COUNT)
// Considerring the extreme condition: 3 bridge chips exist on the branch of each capture card and all capture cards do
// not share the same capture device.
#define MAX_BRIDGE_COUNT_FOR_CAPTURE    (MAX_CHILD_DEVICES+MAX_SUPPORTED_CAPTURE_CARDS*2*3)

typedef struct _S3_PCIE_BRIDGE_CONFIG_SPACE
{
    WORD    VenderID;
    WORD    DeviceID;
    WORD    Command; 
    WORD    Status;
    UCHAR   RevisionID;
    UCHAR   ProgIF;
    UCHAR   SubClass;       // Offset 0x0a: SubClass       04 PCI-PCI Bridge
    UCHAR   BaseClass;      // Offset 0x0b: BaseClass      06 Bridge Device
    UCHAR   CacheLineSize;
    UCHAR   LatencyTimer;
    UCHAR   HeaderType;     // Offset 0x0e
    UCHAR   BIST;
    ULONG   BAR0;           // Offset 0x10
    ULONG   BAR1;           // Offset 0x14
    UCHAR   PriBusNum;      // Offset 0x18
    UCHAR   SecBusNum;      // Offset 0x19      //if 19 = 1a means last  device/bridge
    UCHAR   SubBusNum;      // Offset 0x1a
    UCHAR   SecLatencyTmr;
} S3_PCIE_BRIDGE_CONFIG_SPACE,*PS3_PCIE_BRIDGE_CONFIG_SPACE;


// Capture card's pci config and its bus/device/function, indicate it is 4 capture card or not.
// Its parent' upper stream bridge index in array and down stream bridge index in array
typedef struct _S3_STREAM_CHILD_DEVICE
{
    ULONG                           bus;
    ULONG                           device;
    ULONG                           function;
    S3_PCIE_BRIDGE_CONFIG_SPACE     PciSpace;

    BOOL                            b4CaptureCard;      // Indicate it is S3 4 capture input card or not.
                                                        // Since single card also can link to PLX bridge in motherboard, we can not simply differ it is 4 capture 
                                                        // card from it's parent PLX bridge or not. We need match all bridge's child just only 4,5,6,8,9 S3 capture card.
